# Assignment 1 -- SQL 1

It does not matter whether you show the output of each code block.
Submit your resulting .ipynb file on Canvas.

* COMP 430:  Complete Problems 1-4.  (Your final score will be multiplied by 1.25 to be out of 100 points.)
* COMP 533:  Complete Problems 1-5.

**Specify which course you are in, COMP 430 or 533:**

First, the standard preliminary steps.  For security, don't include your ricedb password.

In [2]:
%load_ext sql

In [3]:
%sql postgresql://ricedb:3816@localhost:5433/postgres

u'Connected: ricedb@postgres'

## Problem 1 (20 points)

We are modeling course enrollments.  Courses can have multiple sections.  Students and sections are in a many-to-many relationship --- students can be in many course sections, and course sections can have many students.  Instructors and sections are in a many-to-many relationship --- instructors can teach multiple course sections, and course sections can have many instructors.

The following schemas show one way to model these ideas.  We'll ignore other issues, such as prerequisites, course enrollment caps, minimum and maximum credit hours per student, and restricting students from taking multiple sections of the same course.

Schemas:
* Person (<u>p_id</u>, first_name, last_name) --- Used for both students and instructors.
* Enrollment (<u>p_id</u>, <u>crn</u>)
* Section (<u>crn</u>, c_id, section)
* Course (<u>c_id</u>, title, dept_code, course_number, credit_hours)
* SectionInstructor (<u>crn</u>, <u>instructor</u>)

Provide SQL code to
* DROP existing versions of the tables, and
* CREATE the described tables, including primary keys and foreign keys.
    - Choose column types that are appropriate for the data described in the next problem.
      You can assume that courses have a single numeric value for their credit hours.
    - Choose appropriate foreign keys.

In [12]:
%%sql 
DROP TABLE IF EXISTS Enrollment;
DROP TABLE IF EXISTS SectionInstructor;
DROP TABLE IF EXISTS Section;

DROP TABLE IF EXISTS Person;
DROP TABLE IF EXISTS Course;


CREATE TABLE Person (/*huhuh*/
    p_id CHAR(9), first_name VARCHAR(15), last_name VARCHAR(15),PRIMARY KEY (p_id)
    );
CREATE TABLE Course (/*huhuh*/
    c_id CHAR(3), title VARCHAR(50), dept_code CHAR(5), 
                     course_number CHAR(10), credit_hours CHAR(2),PRIMARY KEY (c_id)
    );
 
CREATE TABLE Section ( /*huhuh*/
    crn CHAR(5), c_id CHAR(9), section CHAR(3),PRIMARY KEY (crn),
    FOREIGN KEY (c_id) REFERENCES Course (c_id) 
    );

CREATE TABLE SectionInstructor (
    crn CHAR(5), instructor VARCHAR(25),PRIMARY KEY (crn,instructor),
    FOREIGN KEY (crn) REFERENCES Section (crn)
    
    );
CREATE TABLE Enrollment (/*huhuh*/
    p_id CHAR(9), crn CHAR(5),PRIMARY KEY (p_id,crn),
    FOREIGN KEY (p_id) REFERENCES Person (p_id),
    FOREIGN KEY (crn) REFERENCES Section (crn)
    
    
    
    
    );

Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.

[]

## Problem 2 (20 points)

Provide SQL code to add data to the tables.

For the Section, Course, and SectionInstructor tables, use the data from [Rice's Spring 2017 schedule](https://courses.rice.edu/admweb/swkscat.main) for the Computer Science courses COMP 1XX-4XX, excluding the variable-credit COMP 290, 390, and 490, making up appropriate `c_id`'s.  Enter the instructors for these courses in the Person table, making up appropriate `p_id`'s.

Use the following student schedules, making up appropriate student `p_id`'s.  Obviously, these schedules break some of the real-world prerequisite constraints that we are ignoring.
* John Doe is taking COMP 100, COMP 130, and COMP 321 section 3.
* Jane Smith is taking COMP 182 section 2, COMP 310, and COMP 321 section 1.
* William Jones is taking COMP 130, COMP 430, and COMP 321 section 2.
* Mary Williams is taking COMP 427.
* Matt Foster is not taking any courses.

In [13]:
%%sql

INSERT INTO Person VALUES
('S01213278', 'John', 'Doe'),
('S01213279', 'Jane', 'Smith'),
('S01213280', 'William', 'Jones '),
('S01213281', 'Mary', 'Williams'),
('S01213282', 'Matt', 'Foster');
INSERT INTO Course VALUES
('c21', 'INTRO COMPUTING & INFO SYS', 'COMP','100','3'),
('c22', 'ELEMENTS OF ALGORITHMS & COMP', 'COMP','130','4'),
('c23', 'INTRO TO COMPUTER SYSTEMS', 'COMP','321','4'),
('c24', 'ALGORITHMIC THINKING', 'COMP','182','4'),
('c25', 'ADV OBJECT-ORIENTED PROG', 'COMP','310','4'),
('c26', 'INTRO TO DATABASE SYSTEMS', 'COMP','430','4'),
('c27', 'INTRO TO COMPUTER SECURITY', 'COMP','427','3');
INSERT INTO Section VALUES  

('22468','c21','001'),
('22582','c22','001'),
('21256','c23','001'),
('21465','c23','002'),
('22615','c23','003'),
('21510','c24','002'),
('23948','c25','001'),
('20665','c26','001'),
('21500','c27','001');
INSERT INTO Enrollment VALUES

('S01213278', '22468'),
('S01213278', '22582'),
('S01213278', '22615'),
('S01213279', '21510'),
('S01213279', '23948'),
('S01213279', '21256'),
('S01213280', '22582'),
('S01213280', '20665'),
('S01213280', '21465'),
('S01213281', '21500');
INSERT INTO SectionInstructor VALUES
('22468','Joyner, Mackale R.'),
('22582','Greiner, John D.'),
('21256','Cox, Alan L.'),
('21465','Cox, Alan L.'),
('22615','Cox, Alan L.'),

('21510','Nakhleh, Luay'),
('23948','Wong, Stephen B.'),
('20665','Greiner, John D.'),
('21500','Wallach, Dan S.');

5 rows affected.
7 rows affected.
9 rows affected.
10 rows affected.
9 rows affected.

[]

## Problem 3 (20 points)

Create a query that shows what instructors are teaching what courses.  More specifically, the results should have the department code, course number, and instructor's names.  There should be no duplicate rows, even if an instructor teaches multiple sections of the same course.  The results should be sorted by the course information, i.e., alphabetically by department code and then course number.

In [15]:
%%sql
SELECT DISTINCT Course.dept_code, Course.course_number, SectionInstructor.instructor
FROM SectionInstructor

INNER JOIN Section ON SectionInstructor.crn = Section.crn

INNER JOIN Course ON Section.c_id=Course.c_id
ORDER BY Course.dept_code, Course.course_number

7 rows affected.

[(u'COMP ', u'100       ', u'Joyner, Mackale R.'),
 (u'COMP ', u'130       ', u'Greiner, John D.'),
 (u'COMP ', u'182       ', u'Nakhleh, Luay'),
 (u'COMP ', u'310       ', u'Wong, Stephen B.'),
 (u'COMP ', u'321       ', u'Cox, Alan L.'),
 (u'COMP ', u'427       ', u'Wallach, Dan S.'),
 (u'COMP ', u'430       ', u'Greiner, John D.')]

## Problem 4 (20 points)

An instructor would want to see all of his or her rosters.  Write a query where the results have the section information (CRN, department code, course number, section, and title) for every section taught by this particular instructor followed by the student's information (ID, first, and last name) for every student in the course.  The results should be sorted by the crn, then the student's last name and first name.

Since we have have not yet considered how application code could pass arguments to the SQL code, we'll hard-code a single instructor's `p_id` or name into the query's `WHERE` clause.  That instructor will be me, John Greiner.

In [24]:
%%sql
SELECT DISTINCT  Section.crn,Course.dept_code, Course.course_number, Section.section, Course.title,Person.p_id, Person.first_name , Person.last_name
FROM Person
INNER JOIN Enrollment ON Person.p_id=Enrollment.p_id
INNER JOIN SectionInstructor ON Enrollment.crn=SectionInstructor.crn
INNER JOIN Section ON SectionInstructor.crn = Section.crn

INNER JOIN Course ON Section.c_id=Course.c_id
WHERE SectionInstructor.instructor = 'Greiner, John D.'
ORDER BY Section.crn

3 rows affected.

[(u'20665', u'COMP ', u'430       ', u'001', u'INTRO TO DATABASE SYSTEMS', u'S01213280', u'William', u'Jones '),
 (u'22582', u'COMP ', u'130       ', u'001', u'ELEMENTS OF ALGORITHMS & COMP', u'S01213278', u'John', u'Doe'),
 (u'22582', u'COMP ', u'130       ', u'001', u'ELEMENTS OF ALGORITHMS & COMP', u'S01213280', u'William', u'Jones ')]

## Problem 5 (20 points) -- for COMP 533 students

Is it possible to have a table that has a foreign key that references the same table?

If so, give a SQL example table definition and a text description of why or example of when this might be useful.  (Add a code cell and a Markdown cell below.)

If not, describe why not.  (Add a Markdown cell below.)